soap/lapassMx.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://integration.gwclient.smallsystems.cma.se/">
    <soapenv:Header/>
    <soapenv:Body>
        <int:send>
            <session_id>JSESSIONID=B70D529AADB7FDE73821A70C51F8D57C</session_id>
            <message>
                <block4>
                    <![CDATA[<DataPDU xmlns="urn:cma:stp:xsd:stp.1.0">
  <Body>
    <AppHdr xmlns="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <Fr>
        <FIId>
          <FinInstnId>
            <BICFI>LPDRLALAXATM</BICFI>
          </FinInstnId>
        </FIId>
      </Fr>
      <To>
        <FIId>
          <FinInstnId>
            <BICFI>LPDRLALA</BICFI>
          </FinInstnId>
        </FIId>
      </To>
      <BizMsgIdr>BIZ-18063044239483413</BizMsgIdr>
      <MsgDefIdr>pacs.008.001.08</MsgDefIdr>
      <BizSvc>RTGS</BizSvc>
      <CreDt>2019-12-16T10:01:58.202Z</CreDt>
    </AppHdr>
    <Document xmlns="urn:iso:std:iso:20022:tech:xsd:pacs.008.001.08">
      <FIToFICstmrCdtTrf>
        <GrpHdr>
          <MsgId>1000045056</MsgId>
          <CreDtTm>2019-12-16T10:00:20</CreDtTm>
          <NbOfTxs>1</NbOfTxs>
          <SttlmInf>
            <SttlmMtd>CLRG</SttlmMtd>
          </SttlmInf>
        </GrpHdr>
        <CdtTrfTxInf>
          <PmtId>
            <InstrId>1000045056</InstrId>
            <EndToEndId>NOTPROVIDED</EndToEndId>
            <TxId>1000045056</TxId>
          </PmtId>
          <PmtTpInf>
            <ClrChanl>RTGS</ClrChanl>
            <SvcLvl>
              <Prtry>0010</Prtry>
            </SvcLvl>
            <LclInstrm>
              <Prtry>RTGS-SSCT</Prtry>
            </LclInstrm>
            <CtgyPurp>
              <Prtry>001</Prtry>
            </CtgyPurp>
          </PmtTpInf>
          <IntrBkSttlmAmt Ccy="LAK">20615.</IntrBkSttlmAmt>
          <IntrBkSttlmDt>2025-01-03</IntrBkSttlmDt>
          <ChrgBr>SHAR</ChrgBr>
          <InstgAgt>
            <FinInstnId>
              <BICFI>LPDRLALAXATM</BICFI>
            </FinInstnId>
          </InstgAgt>
          <InstdAgt>
            <FinInstnId>
              <BICFI>LPDRLALA</BICFI>
            </FinInstnId>
          </InstdAgt>
          <Dbtr>
            <Nm>LDB Shares trading</Nm>
            <PstlAdr/>
          </Dbtr>
          <DbtrAcct>
            <Id>
              <Othr>
                <Id>0000000000340507</Id>
              </Othr>
            </Id>
          </DbtrAcct>
          <DbtrAgt>
            <FinInstnId>
              <BICFI>LDBBLALA</BICFI>
            </FinInstnId>
          </DbtrAgt>
          <DbtrAgtAcct>
            <Id>
              <Othr>
                <Id>0000000000340507</Id>
              </Othr>
            </Id>
          </DbtrAgtAcct>
          <CdtrAgt>
            <FinInstnId>
              <BICFI>LPDRLALA</BICFI>
            </FinInstnId>
          </CdtrAgt>
          <CdtrAgtAcct>
            <Id>
              <Othr>
                <Id>0000000094850501</Id>
              </Othr>
            </Id>
          </CdtrAgtAcct>
          <Cdtr>
            <Nm>Shares trading SECO Fee</Nm>
            <PstlAdr/>
          </Cdtr>
          <CdtrAcct>
            <Id>
              <Othr>
                <Id>0000000129450101</Id>
              </Othr>
            </Id>
          </CdtrAcct>
          <InstrForNxtAgt>
            <InstrInf>/BNF/</InstrInf>
          </InstrForNxtAgt>
          <RmtInf>
            <Ustrd>/INFO</Ustrd>
          </RmtInf>
        </CdtTrfTxInf>
      </FIToFICstmrCdtTrf>
    </Document>
  </Body>
</DataPDU>
]]>
                </block4>
                <msgReceiver>LPDRLALAXATS</msgReceiver>
                <msgSender>LPDRLALAAATM</msgSender>
                <msgSequence>123</msgSequence>
                <msgType>pacs.008.001.08</msgType>
                <format>MX</format>
            </message>
        </int:send>
    </soapenv:Body>
</soapenv:Envelope>